#Область ОбработчикиСобытий

// Формирует движения расхода товаров по регистру остатков.
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ОстаткиТоваров Расход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекущаяСтрокаТоваров Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекущаяСтрокаТоваров.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекущаяСтрокаТоваров.Количество;
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти