#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.ПересчитатьСуммуСтроки(СтрокаТоваров);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	РаботаСДокументами.ПересчитатьСуммуСтроки(СтрокаТоваров);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	
	// Получить текущую строку табличной части.
	СтрокаТоваров = Элементы.Товары.ТекущиеДанные;
	
	// Установить цену.
	ЦенаТовара = РаботаСоСправочниками.ПолучитьЦенуТовара(Объект.Дата, СтрокаТоваров.Товар);
	
	Если ЦенаТовара = 0 Тогда
		СтрокаТоваров.Цена = 0;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У данного товара нет актуальной цены!";
		Сообщение.Сообщить();
	Иначе
		СтрокаТоваров.Цена = ЦенаТовара;
	КонецЕсли;
	
	// Пересчитать сумму строки
	РаботаСДокументами.ПересчитатьСуммуСтроки(СтрокаТоваров);
	
КонецПроцедуры

#КонецОбласти